benchmark/CVE-2021-43474/update_seed.py

import requests
import re

def get_new_token(target_ip,target_port):
    # burp0_url = "http://"+target_ip+":"+str(target_port)+"/userRpm/LoginRpm.htm?Save=Save"
    # burp0_cookies = {"Authorization": "Basic%20YWRtaW46MjEyMzJmMjk3YTU3YTVhNzQzODk0YTBlNGE4MDFmYzM%3D"}
    # burp0_headers = {"User-Agent": "Mozilla/5.0 (X11; Linux aarch64; rv:78.0) Gecko/20100101 Firefox/78.0", "Accept": "text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8", "Accept-Language": "en-US,en;q=0.5", "Accept-Encoding": "gzip, deflate", "Connection": "close", "Referer": "http://192.168.0.1/", "Upgrade-Insecure-Requests": "1"}
    # burp0_url = "http://192.168.0.1:80/Home.html"
    # burp0_cookies = {"uid": "ujcI4DPmyw", "PrivateKey": "C8B843B87E7C03EF5F224D6D4949A7F1", "timeout": "8"}
    # burp0_headers = {"User-Agent": "Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:73.0) Gecko/20100101 Firefox/73.0", "Accept": "text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8", "Accept-Language": "en-US,en;q=0.5", "Accept-Encoding": "gzip, deflate", "Referer": "http://192.168.0.1/Login.html", "Connection": "close", "Upgrade-Insecure-Requests": "1", "If-Modified-Since": "Tue Jul 24 09:46:32 2018", "Cache-Control": "max-age=0"}
    # results=requests.get(burp0_url, headers=burp0_headers, cookies=burp0_cookies)
    burp0_url = "http://192.168.0.1:80/HNAP1/"
    burp0_cookies = {"uid": "ujcI4DPmyw", "PrivateKey": "C8B843B87E7C03EF5F224D6D4949A7F1", "timeout": "5"}
    burp0_headers = {"User-Agent": "Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:73.0) Gecko/20100101 Firefox/73.0", "Accept": "*/*", "Accept-Language": "en-US,en;q=0.5", "Accept-Encoding": "gzip, deflate", "Content-Type": "text/xml; charset=utf-8", "SOAPAction": "\"http://purenetworks.com/HNAP1/Login\"", "HNAP_AUTH": "E56D1F478682B06F002983C7585DE842 1669723035", "X-Requested-With": "XMLHttpRequest", "Origin": "http://192.168.0.1", "Connection": "close", "Referer": "http://192.168.0.1/Login.html"}
    burp0_data = "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><Login xmlns=\"http://purenetworks.com/HNAP1/\"><Action>request</Action><Username>Admin</Username><LoginPassword></LoginPassword><Captcha></Captcha><PrivateLogin>LoginPassword</PrivateLogin></Login></soap:Body></soap:Envelope>"
    results=requests.post(burp0_url, headers=burp0_headers, cookies=burp0_cookies, data=burp0_data)
    results_str = results.text

    new_token = results_str[results_str.find('</PublicKey>')-90:results_str.find('</PublicKey>')-1]

    return new_token

def set_new_token(seed,new_token):
    seed_begin = seed[:seed.find('<Challenge>')+1]
    seed_end = seed[seed.find('</PublicKey>')-1:]
    updated_seed = seed_begin + new_token + seed_end
    return updated_seed

def update_seed(seed='',target_ip = '192.168.0.1',target_port = 80):
    #no need to update
    seed=seed
    return seed

if __name__ == '__main__':
    target_ip = '192.168.0.1'
    target_port = 80
    seed='''POST /HNAP1/ HTTP/1.1
Host: 192.168.0.1
User-Agent: Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:73.0) Gecko/20100101 Firefox/73.0
Accept: */*
Accept-Language: en-US,en;q=0.5
Accept-Encoding: gzip, deflate
Content-Type: text/xml; charset=utf-8
SOAPAction: "http://purenetworks.com/HNAP1/Login"
X-Requested-With: XMLHttpRequest
Content-Length: 442
Origin: http://192.168.0.1
Connection: close
Referer: http://192.168.0.1/Login.html<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <Login xmlns="http://purenetworks.com/HNAP1/">
            <Action>request</Action>
            <Username>Admin</Username>
            <LoginPassword></LoginPassword>
            <Captcha></Captcha>
            <PrivateLogin>LoginPassword</PrivateLogin>
        </Login>
    </soap:Body>
</soap:Envelope>
'''
    updated_seed = update_seed(seed,target_ip,target_port)
    print(updated_seed)
